In [3]:
                                                # PROBLEM 1 #
# PART 1
# Find the total number of unique products.

In [4]:
# First, I used the COUNT function to get the total number of values in the product_id column. 
# I then used the COUNT function combined with the DISTINCT statement to find unique product names from the info table. 
# We see that many products have more than one product_id.

In [5]:
%%sql 
SELECT COUNT(product_id) as product_id_count, COUNT(DISTINCT product_name) AS unique_products_count 
FROM info

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(3179, 1511)]

In [6]:
# PART 2 
# Are there any null values in the info table?

In [7]:
# I used a COUNT function for every column of the info table and subtracted it from the total count of rows.
# Since the COUNT function does NOT count null values, once we subtract it from count of total rows, we will obtain the number of null values.
# It's no surprise that the product_id column had no NULL values since this is the PRIMARY KEY. The other columns in the info table have NULL values.

In [8]:
%%sql 
SELECT COUNT(*) - COUNT(product_id) AS product_id_null_count,
       COUNT(*) - COUNT(product_name) AS product_name_null_count, 
       COUNT(*) - COUNT(description) AS description_null_count
FROM info

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(0, 59, 62)]

In [9]:
                                                # PROBLEM 2 #
# Which product(s) was most recently viewed and which product(s) was least recently viewed?

In [10]:
# I joined the traffic and brands tables. There are two select statements (2 tables) which I combined using the UNION operator.
# In the first table, we obtain the least recently viewed products and in the second table we obtain the most recently viewed products.
# This is done by adding a subquery in the WHERE clause. In this subquery we get the MIN and MAX of last_visited date.

In [11]:
%%sql 
SELECT brand, t.product_id, last_visited
FROM traffic t
JOIN brands b
ON t.product_id = b.product_id
WHERE last_visited = (SELECT MIN(last_visited) FROM traffic)

UNION

SELECT brand, t.product_id, last_visited
FROM traffic t
JOIN brands b
ON t.product_id = b.product_id
WHERE last_visited = (SELECT MAX(last_visited) FROM traffic)
ORDER BY last_visited

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
8 rows affected.

[('Adidas', 'FV3671', datetime.date(2018, 1, 1)),
 ('Adidas', 'F34038', datetime.date(2018, 1, 1)),
 ('Adidas', 'G28372', datetime.date(2018, 1, 1)),
 ('Adidas', 'F36236', datetime.date(2020, 4, 12)),
 ('Adidas', 'CJ8116', datetime.date(2020, 4, 12)),
 ('Adidas', 'CL4156', datetime.date(2020, 4, 12)),
 ('Nike', 'CI3869-500', datetime.date(2020, 4, 12)),
 ('Nike', 'CD0917-300', datetime.date(2020, 4, 12))]

In [12]:
                                                # PROBLEM 3 #
# Find the number of products and the average rating for each brand.

In [13]:
# We must join the brands and reviews tables and use the COUNT, SUM and ROUND functions.
# I filtered out NULL values for the brand and used a GROUP BY statement for brand.
# The table shows that there is approximately five times more Adidas products than Nike products and that Nike products have a higher rating.

In [14]:
%%sql 
SELECT brand, 
       COUNT(*) AS count_products,
	   ROUND(AVG(rating), 2) AS average_rating
FROM brands b
JOIN info i
ON b.product_id = i.product_id
JOIN reviews r
ON b.product_id = r.product_id
WHERE brand IS NOT NULL
GROUP BY brand

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
2 rows affected.

[('Adidas', 2575, Decimal('3.37')), ('Nike', 545, Decimal('4.24'))]

In [15]:
                                                # PROBLEM 4 #
# PART 1
# For each brand, find the following information: number of products sold, sum of total sales and the minimum, maximum and average of the sale price.

In [16]:
# We must use MIN, MAX, ROUND, AVG and SUM functions to solve this problem. 
# I joined the transactions and brands tables and used a GROUP BY statement.
# The final table shows that Adidas has sold more products than Nike and collected more revenue. Also, we see that Nike has nearly double the average sale price of Adidas.

In [17]:
%%sql
SELECT brand, 
       COUNT(*) AS number_of_products_sold,
	   SUM(sale_price) AS sum_revenue,
       MIN(sale_price) AS min_sale_price, 
	   MAX(sale_price) AS max_sale_price,  
       ROUND(AVG(sale_price), 2) AS avg_sale_price
FROM transactions t
JOIN brands b
ON t.product_id = b.product_id
WHERE brand IS NOT NULL
GROUP BY brand

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
2 rows affected.

[('Adidas', 17515, Decimal('894696.07'), Decimal('4.49'), Decimal('299.99'), Decimal('51.08')),
 ('Nike', 3210, Decimal('326572.44'), Decimal('15.95'), Decimal('249.95'), Decimal('101.74'))]

In [18]:
# PART 2
# What percentage of revenue does each brand have compared to the total revenue?

In [19]:
# I first need the revenue of a particular brand. Then, I use this result in a subquery and divide it by the total revenue. 
# I used the ROUND function to get 2 decimals, I multiplied by 100 to get a percentage and used the CONCAT function to add a percentage sign. 
# The data shows that Adidas products have made nearly 75% of the total revenue.

In [20]:
%%sql
SELECT
	CONCAT(ROUND((SELECT SUM(sale_price) 
	 			  FROM transactions t 
	 		      JOIN brands b
	              ON t.product_id = b.product_id 
	              WHERE brand = 'Adidas')
	/SUM(sale_price)*100, 2), '%') AS adidas_portion_revenue,
	
	CONCAT(ROUND((SELECT SUM(sale_price) 
	 			  FROM transactions t 
	 		      JOIN brands b
	              ON t.product_id = b.product_id 
	              WHERE brand = 'Nike')
	/SUM(sale_price)*100, 2), '%') AS nike_portion_revenue
FROM transactions

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[('73.26%', '26.74%')]

In [21]:
                                               # PROBLEM 5 #
# PART 1
# What are the 10 products with the highest revenue?

In [22]:
# I joined the transactions, info and brands tables together.
# I used an ORDER BY clause to sort the revenue in descending order and I used a LIMIT clause to only obtain the top 10 rows (top 10 products).
# We see that 9/10 products with the highest revenue are from Adidas.

In [23]:
%%sql
SELECT brand, product_name, SUM(sale_price) AS total_sales
FROM transactions t
JOIN info i
ON t.product_id = i.product_id
JOIN brands b
ON t.product_id = b.product_id
WHERE product_name IS NOT NULL
GROUP BY product_name, brand
ORDER BY total_sales DESC
LIMIT 10

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
10 rows affected.

[('Adidas', "Men's adidas Originals ZX 4000 4D Shoes", Decimal('8619.70')),
 ('Adidas', "Men's adidas Running Ultraboost 19 Shoes", Decimal('8490.31')),
 ('Adidas', 'Unisex adidas Originals Marathon Tech Shoes', Decimal('7909.04')),
 ('Adidas', "Men's adidas Originals Supercourt Shoes", Decimal('7415.15')),
 ('Nike', 'Nike Air Max 90', Decimal('7402.77')),
 ('Adidas', "Women's adidas Originals Sambarose Shoes", Decimal('7052.99')),
 ('Adidas', "Women's adidas Originals NMD_R1 Shoes", Decimal('7043.19')),
 ('Adidas', "Men's adidas Originals Stan Smith Shoes", Decimal('6317.17')),
 ('Adidas', "Men's adidas Originals Continental 80 Shoes", Decimal('6216.98')),
 ('Adidas', "Women's adidas Running Ultraboost 19 Shoes", Decimal('6019.49'))]

In [24]:
# PART 2
# There is one Nike product in the top 10 of highest selling products. What portion of the revenue does this specific product have in the total revenue for Nike?

In [25]:
# The query is like PART 1, but we must filter out all Adidas products. 
# I used a subquery within the select statement. This subquery represents the total revenue for Nike products. I divided the revenue for each row by this total revenue.  
# The table shows that the product with the highest revenue represents over 2.25% of the total revenue for Nike products and the next product is at 1.75%.

In [26]:
%%sql
SELECT brand, 
       product_name, 
       SUM(sale_price) as revenue, 
	   CONCAT(ROUND(SUM(sale_price)/(SELECT SUM(sale_price) as revenue
								     FROM transactions t                            
                                     JOIN brands b
                                     ON t.product_id = b.product_id
                                     WHERE brand = 'Nike')*100, 2), '%') AS portion_of_revenue
FROM transactions t
JOIN brands b
ON t.product_id = b.product_id
JOIN info i
ON t.product_id = i.product_id
WHERE brand = 'Nike'
GROUP BY product_name, brand
ORDER BY revenue DESC
LIMIT 10

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
10 rows affected.

[('Nike', 'Nike Air Max 90', Decimal('7402.77'), '2.27%'),
 ('Nike', 'Nike Air Max 97', Decimal('5703.31'), '1.75%'),
 ('Nike', 'Nike Air Max 270 React', Decimal('5204.03'), '1.59%'),
 ('Nike', 'Nike Air VaporMax 360', Decimal('5128.65'), '1.57%'),
 ('Nike', 'Nike Air Zoom Pegasus 36', Decimal('4190.07'), '1.28%'),
 ('Nike', 'Nike Air Max 98', Decimal('3776.88'), '1.16%'),
 ('Nike', 'Nike Zoom Pegasus Turbo 2', Decimal('3582.91'), '1.10%'),
 ('Nike', 'Nike Air VaporMax Flyknit 3', Decimal('3568.95'), '1.09%'),
 ('Nike', 'Nike Air Max 2090', Decimal('3538.60'), '1.08%'),
 ('Nike', 'Nike Mercurial Vapor 13 Elite FG', Decimal('3519.20'), '1.08%')]

In [27]:
                                                # PROBLEM 6 #
# PART 1
# Calculate the correlation between sale_price and rating.

In [28]:
# I used the CORR function to get the correlation coefficient and CAST function to convert the number into a numeric data type.

In [29]:
%%sql
SELECT ROUND(CAST(CORR(sale_price, rating) AS numeric), 2) AS rating_revenue_correlation
FROM transactions t
JOIN reviews r
ON t.product_id = r.product_id

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(Decimal('0.13'),)]

In [30]:
# PART 2
# Calculate the correlation between the rating and the number of times a product is sold.

In [31]:
# Since we can't use an aggregate function within the CORR function, we need a CTE (common table expression).

In [32]:
%%sql
WITH CTE AS 
(
	SELECT product_id, COUNT(product_id) as total_sales
    FROM transactions
    GROUP BY product_id
)
SELECT ROUND(CAST(CORR(total_sales, rating) AS numeric), 2) AS rating_revenue_correlation
FROM CTE
JOIN reviews r
ON cte.product_id = r.product_id

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(Decimal('0.37'),)]

In [33]:
                                                # PROBLEM 7 #
# Create a table showing the rating within different categories ranging from terrible to excellent for each brand. 
# Also include the number of products and the total revenue within each category.

In [34]:
# A CASE statement must be used to achieve the desired result. I also joined the reviews, brands and transactions tables and sorted the results by total revenue in descending order. 
# The final table shows Nike has no products in the terrible rating category and each brand has more products in the excellent and good rating categories.

In [35]:
%%sql
SELECT brand, 
	CASE 
		WHEN 0 <= rating AND rating < 1 THEN 'Terrible rating'
		WHEN 1 <= rating AND rating < 2 THEN 'Poor rating'
		WHEN 2 <= rating AND rating < 3 THEN 'Mediocre rating'
		WHEN 3 <= rating AND rating < 4 THEN 'Good rating'
		ELSE 'Excellent rating'
	END AS rating_category,
	COUNT(DISTINCT t.product_id) AS number_of_products,
	COUNT(*) AS number_of_products_sold,    
	SUM(sale_price) AS total_revenue
FROM reviews r
JOIN brands b
ON r.product_id = b.product_id
JOIN transactions t
ON r.product_id = t.product_id
WHERE rating IS NOT NULL
GROUP BY brand, rating_category
ORDER BY total_revenue DESC

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
9 rows affected.

[('Adidas', 'Excellent rating', 921, 7192, Decimal('368995.22')),
 ('Adidas', 'Good rating', 772, 6605, Decimal('345311.46')),
 ('Nike', 'Excellent rating', 266, 2081, Decimal('214638.51')),
 ('Adidas', 'Mediocre rating', 609, 2412, Decimal('117449.95')),
 ('Nike', 'Good rating', 67, 574, Decimal('59059.72')),
 ('Adidas', 'Poor rating', 159, 1000, Decimal('47260.25')),
 ('Adidas', 'Terrible rating', 61, 157, Decimal('8111.43')),
 ('Nike', 'Mediocre rating', 19, 61, Decimal('5714.53')),
 ('Nike', 'Poor rating', 6, 53, Decimal('4474.11'))]

In [36]:
                                                # PROBLEM 8 #
# Create different categories for the length of the description column and calculate the number of products and the average rating for each category.

In [37]:
# This query will return the max character length for the description column. I used the MAX and LENGTH functions.

In [38]:
%%sql
SELECT MAX(LENGTH(description)) AS max_description_length FROM info

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(687,)]

In [39]:
# After obtaining the maximum length of the description column, I created different categories using a CASE statement. 
# I used COUNT and AVG functions and I joined info and reviews tables together. 
# The results shows that most products have a description length between 200-299 and that the average rating is similar for each category.

In [40]:
%%sql
SELECT 
	CASE
	WHEN LENGTH(description) < 100 THEN '0-99' 
	WHEN LENGTH(description) < 200 THEN '100-199' 
	WHEN LENGTH(description) < 300 THEN '200-299' 
	WHEN LENGTH(description) < 400 THEN '300-399' 
	WHEN LENGTH(description) < 500 THEN '400-499' 
	WHEN LENGTH(description) < 600 THEN '500-599' 
	ELSE '600-699'
	END AS description_length,
	
	COUNT(i.product_id) AS number_of_products, 
	ROUND(AVG(rating), 2) AS average_rating

FROM info i
JOIN reviews r
ON i.product_id = r.product_id
WHERE description IS NOT NULL
GROUP BY description_length
ORDER BY description_length

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
7 rows affected.

[('0-99', 6, Decimal('3.73')),
 ('100-199', 503, Decimal('3.68')),
 ('200-299', 1804, Decimal('3.44')),
 ('300-399', 652, Decimal('3.44')),
 ('400-499', 122, Decimal('3.38')),
 ('500-599', 15, Decimal('3.34')),
 ('600-699', 15, Decimal('3.65'))]

In [41]:
                                                # PROBLEM 9 #
# PART 1
# Find the number of products for men and for women.

In [42]:
# In the WHERE clause, I used the LIKE operator for the product_name column.
# I used CROSS JOIN to join the result for 'men' and the result for 'women'.
# Finally, it's critical to use the LOWER function in the WHERE clause. The LIKE operator is case sensitive, therefore 'Men' is different than 'men'. 
# The table shows that most products are for men.

In [43]:
%%sql
SELECT COUNT(i1.product_id) AS men_products_count, i2.women_products_count
FROM info i1
CROSS JOIN (SELECT COUNT(product_id) AS women_products_count
			FROM info 
			WHERE LOWER(product_name) LIKE '%women%') i2
WHERE LOWER(product_name) LIKE '%men%'
GROUP BY i2.women_products_count

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(2488, 766)]

In [44]:
# PART 2
# Find the number of products that are either slippers or sandals.

In [45]:
# To solve this problem, I used the OR operator within the WHERE clause.

In [46]:
%%sql
SELECT COUNT(product_id) AS product_count
FROM info
WHERE LOWER(product_name) LIKE '%slipper%' OR LOWER(product_name) LIKE '%sandal%'

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(145,)]

In [47]:
# PART 3
# Most of the products sold are shoes, what portion of the total revenue are from shoe sales?

In [48]:
# We must use the SUM function and join info and transactions tables together.
# This shows that approximately 68% of the total revenue is from shoe sales.

In [49]:
%%sql
SELECT CONCAT(ROUND((SELECT SUM(sale_price) AS revenue_shoes
		FROM info i
        JOIN transactions t
        ON i.product_id = t.product_id
        WHERE LOWER(product_name) LIKE '%shoes%') / SUM(sale_price)*100, 2), '%') AS shoe_products_revenue_portion
FROM transactions

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[('67.74%',)]

In [50]:
                                                # PROBLEM 10 #
# PART 1
# Find the number of products for each sale price.

In [51]:
# Join transactions to brands on product_id and use the COUNT function with a DISTINCT statement on the product_id column from the transactions table.
# Aggregate results by brand and sale_price and sort the results by sale_price in descending order.
# We see that Adidas products occupy most of the low sale prices.

In [52]:
%%sql
SELECT brand, sale_price AS sale_price, COUNT(DISTINCT t.product_id) AS count
FROM transactions t
JOIN brands b
ON t.product_id = b.product_id
WHERE brand IS NOT NULL
GROUP BY brand, sale_price
ORDER BY sale_price DESC

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
224 rows affected.

[('Adidas', Decimal('299.99'), 2),
 ('Adidas', Decimal('279.99'), 3),
 ('Nike', Decimal('249.95'), 2),
 ('Adidas', Decimal('239.99'), 4),
 ('Adidas', Decimal('229.99'), 1),
 ('Nike', Decimal('229.95'), 4),
 ('Adidas', Decimal('219.99'), 4),
 ('Nike', Decimal('219.95'), 2),
 ('Nike', Decimal('209.95'), 1),
 ('Adidas', Decimal('199.99'), 6),
 ('Nike', Decimal('199.95'), 3),
 ('Adidas', Decimal('189.99'), 2),
 ('Nike', Decimal('189.95'), 6),
 ('Adidas', Decimal('179.99'), 18),
 ('Nike', Decimal('179.95'), 1),
 ('Adidas', Decimal('169.99'), 9),
 ('Nike', Decimal('169.95'), 16),
 ('Adidas', Decimal('159.99'), 3),
 ('Nike', Decimal('159.97'), 1),
 ('Nike', Decimal('159.95'), 30),
 ('Nike', Decimal('151.97'), 1),
 ('Adidas', Decimal('149.99'), 11),
 ('Nike', Decimal('149.95'), 17),
 ('Nike', Decimal('144.95'), 1),
 ('Nike', Decimal('143.97'), 2),
 ('Adidas', Decimal('139.99'), 9),
 ('Nike', Decimal('139.95'), 17),
 ('Adidas', Decimal('137.99'), 5),
 ('Nike', Decimal('135.97'), 8),
 ('Nike', Decimal('134.95'), 1),
 ('Adidas', Decimal('132.99'), 1),
 ('Nike', Decimal('132.97'), 1),
 ('Adidas', Decimal('131.99'), 2),
 ('Adidas', Decimal('129.99'), 30),
 ('Nike', Decimal('129.95'), 14),
 ('Nike', Decimal('127.97'), 9),
 ('Adidas', Decimal('125.99'), 9),
 ('Nike', Decimal('125.97'), 2),
 ('Adidas', Decimal('119.99'), 23),
 ('Nike', Decimal('119.97'), 3),
 ('Nike', Decimal('119.95'), 26),
 ('Adidas', Decimal('118.99'), 12),
 ('Nike', Decimal('118.97'), 2),
 ('Adidas', Decimal('114.99'), 2),
 ('Adidas', Decimal('111.99'), 6),
 ('Nike', Decimal('111.97'), 18),
 ('Adidas', Decimal('109.99'), 48),
 ('Nike', Decimal('109.95'), 28),
 ('Adidas', Decimal('107.99'), 1),
 ('Adidas', Decimal('104.99'), 3),
 ('Nike', Decimal('104.97'), 2),
 ('Nike', Decimal('104.95'), 2),
 ('Nike', Decimal('103.97'), 4),
 ('Adidas', Decimal('101.99'), 1),
 ('Nike', Decimal('101.97'), 3),
 ('Adidas', Decimal('99.99'), 19),
 ('Nike', Decimal('99.95'), 40),
 ('Adidas', Decimal('97.99'), 2),
 ('Nike', Decimal('97.97'), 3),
 ('Nike', Decimal('96.37'), 1),
 ('Adidas', Decimal('95.99'), 6),
 ('Nike', Decimal('95.97'), 12),
 ('Adidas', Decimal('94.99'), 3),
 ('Nike', Decimal('94.95'), 1),
 ('Adidas', Decimal('90.99'), 1),
 ('Nike', Decimal('90.97'), 3),
 ('Adidas', Decimal('89.99'), 41),
 ('Nike', Decimal('89.97'), 2),
 ('Nike', Decimal('89.95'), 19),
 ('Nike', Decimal('87.97'), 4),
 ('Nike', Decimal('87.95'), 2),
 ('Adidas', Decimal('85.99'), 2),
 ('Adidas', Decimal('84.99'), 4),
 ('Nike', Decimal('84.95'), 4),
 ('Adidas', Decimal('83.99'), 9),
 ('Nike', Decimal('83.97'), 8),
 ('Adidas', Decimal('79.99'), 97),
 ('Nike', Decimal('79.97'), 5),
 ('Nike', Decimal('79.95'), 31),
 ('Adidas', Decimal('77.99'), 39),
 ('Nike', Decimal('77.97'), 5),
 ('Adidas', Decimal('76.99'), 2),
 ('Nike', Decimal('76.97'), 7),
 ('Adidas', Decimal('76'), 1),
 ('Adidas', Decimal('75.99'), 43),
 ('Nike', Decimal('75.97'), 1),
 ('Nike', Decimal('75.95'), 3),
 ('Adidas', Decimal('74.99'), 14),
 ('Nike', Decimal('74.95'), 9),
 ('Nike', Decimal('72.95'), 1),
 ('Adidas', Decimal('71.99'), 50),
 ('Nike', Decimal('71.97'), 11),
 ('Adidas', Decimal('69.99'), 30),
 ('Nike', Decimal('69.97'), 4),
 ('Nike', Decimal('69.95'), 14),
 ('Adidas', Decimal('68'), 1),
 ('Nike', Decimal('67.97'), 2),
 ('Adidas', Decimal('65.99'), 47),
 ('Nike', Decimal('65.97'), 5),
 ('Nike', Decimal('65.95'), 1),
 ('Adidas', Decimal('64.99'), 23),
 ('Nike', Decimal('64.95'), 9),
 ('Adidas', Decimal('64'), 1),
 ('Nike', Decimal('63.97'), 7),
 ('Nike', Decimal('63.17'), 1),
 ('Adidas', Decimal('62.99'), 1),
 ('Nike', Decimal('62.97'), 2),
 ('Adidas', Decimal('60'), 1),
 ('Adidas', Decimal('59.99'), 95),
 ('Nike', Decimal('59.97'), 6),
 ('Nike', Decimal('59.95'), 9),
 ('Nike', Decimal('59.47'), 3),
 ('Adidas', Decimal('57.59'), 1),
 ('Adidas', Decimal('56'), 4),
 ('Adidas', Decimal('55.99'), 39),
 ('Nike', Decimal('55.97'), 7),
 ('Adidas', Decimal('54.99'), 16),
 ('Nike', Decimal('54.95'), 6),
 ('Adidas', Decimal('53.99'), 28),
 ('Nike', Decimal('53.97'), 4),
 ('Adidas', Decimal('53.19'), 7),
 ('Adidas', Decimal('52.99'), 5),
 ('Nike', Decimal('52.95'), 1),
 ('Nike', Decimal('52.47'), 6),
 ('Adidas', Decimal('52'), 3),
 ('Adidas', Decimal('51.59'), 1),
 ('Adidas', Decimal('49.99'), 69),
 ('Nike', Decimal('49.95'), 3),
 ('Nike', Decimal('48.97'), 1),
 ('Adidas', Decimal('48'), 2),
 ('Adidas', Decimal('47.99'), 97),
 ('Nike', Decimal('47.97'), 5),
 ('Adidas', Decimal('46.19'), 2),
 ('Adidas', Decimal('45.99'), 29),
 ('Adidas', Decimal('45.59'), 61),
 ('Nike', Decimal('45.47'), 1),
 ('Adidas', Decimal('44.99'), 33),
 ('Nike', Decimal('44.97'), 1),
 ('Nike', Decimal('44.95'), 6),
 ('Adidas', Decimal('44.79'), 3),
 ('Adidas', Decimal('44'), 6),
 ('Adidas', Decimal('42.99'), 7),
 ('Adidas', Decimal('42.39'), 1),
 ('Adidas', Decimal('41.99'), 36),
 ('Nike', Decimal('41.97'), 1),
 ('Adidas', Decimal('40'), 7),
 ('Adidas', Decimal('39.99'), 155),
 ('Nike', Decimal('39.97'), 2),
 ('Nike', Decimal('39.95'), 1),
 ('Adidas', Decimal('39.59'), 52),
 ('Adidas', Decimal('39.19'), 5),
 ('Adidas', Decimal('38.39'), 9),
 ('Adidas', Decimal('37.99'), 40),
 ('Nike', Decimal('36.95'), 1),
 ('Adidas', Decimal('36.79'), 8),
 ('Adidas', Decimal('36'), 3),
 ('Adidas', Decimal('35.99'), 68),
 ('Nike', Decimal('35.97'), 1),
 ('Adidas', Decimal('34.99'), 46),
 ('Nike', Decimal('34.97'), 3),
 ('Adidas', Decimal('34.39'), 4),
 ('Adidas', Decimal('34'), 1),
 ('Adidas', Decimal('33.59'), 44),
 ('Nike', Decimal('33.57'), 1),
 ('Adidas', Decimal('32.99'), 30),
 ('Adidas', Decimal('32.19'), 1),
 ('Adidas', Decimal('32'), 3),
 ('Adidas', Decimal('31.99'), 8),
 ('Nike', Decimal('31.97'), 1),
 ('Adidas', Decimal('31.79'), 6),
 ('Adidas', Decimal('31.49'), 1),
 ('Nike', Decimal('31.47'), 2),
 ('Adidas', Decimal('30.4'), 1),
 ('Adidas', Decimal('30'), 1),
 ('Adidas', Decimal('29.99'), 140),
 ('Nike', Decimal('29.95'), 1),
 ('Adidas', Decimal('28.79'), 8),
 ('Adidas', Decimal('27.99'), 102),
 ('Nike', Decimal('27.95'), 1),
 ('Adidas', Decimal('27.59'), 34),
 ('Adidas', Decimal('27.49'), 2),
 ('Adidas', Decimal('26.99'), 3),
 ('Adidas', Decimal('26.49'), 30),
 ('Adidas', Decimal('26.4'), 1),
 ('Adidas', Decimal('25.79'), 5),
 ('Adidas', Decimal('24.99'), 101),
 ('Nike', Decimal('24.95'), 3),
 ('Adidas', Decimal('24'), 5),
 ('Adidas', Decimal('23.99'), 49),
 ('Nike', Decimal('23.97'), 1),
 ('Adidas', Decimal('22.99'), 86),
 ('Adidas', Decimal('22.79'), 6),
 ('Adidas', Decimal('22.49'), 1),
 ('Adidas', Decimal('22.4'), 3),
 ('Adidas', Decimal('21.59'), 13),
 ('Adidas', Decimal('21.49'), 39),
 ('Adidas', Decimal('20'), 6),
 ('Adidas', Decimal('19.99'), 26),
 ('Nike', Decimal('19.95'), 2),
 ('Adidas', Decimal('19.79'), 11),
 ('Adidas', Decimal('19.2'), 2),
 ('Adidas', Decimal('18.99'), 13),
 ('Adidas', Decimal('18.89'), 11),
 ('Adidas', Decimal('18.4'), 5),
 ('Adidas', Decimal('17.99'), 20),
 ('Adidas', Decimal('17.49'), 8),
 ('Adidas', Decimal('16.79'), 19),
 ('Adidas', Decimal('16.49'), 6),
 ('Nike', Decimal('15.95'), 3),
 ('Adidas', Decimal('14.99'), 19),
 ('Adidas', Decimal('13.99'), 6),
 ('Adidas', Decimal('13.49'), 1),
 ('Adidas', Decimal('12.99'), 8),
 ('Adidas', Decimal('12.49'), 6),
 ('Adidas', Decimal('9.99'), 5),
 ('Adidas', Decimal('9.59'), 4),
 ('Adidas', Decimal('8.99'), 14),
 ('Adidas', Decimal('7.79'), 16),
 ('Adidas', Decimal('7.49'), 6),
 ('Adidas', Decimal('6.49'), 3),
 ('Adidas', Decimal('6'), 1),
 ('Adidas', Decimal('5.99'), 8),
 ('Adidas', Decimal('4.99'), 4),
 ('Adidas', Decimal('4.49'), 1)]

In [53]:
# PART 2
# Find the most popular sale price for each brand.

In [54]:
# Most popular means the sale price with the most products sold, not the sale price with the highest number of products. 
# I can use a query nearly identical to PART 1 within a CTE, but I need to use COUNT(*) instead of COUNT(DISTINCT t.product_id).
# In there WHERE clause, I added a subquery that returns the max count for a specific brand. 
# Also, I used the UNION operator to join the result for Adidas with the result for Nike.

In [55]:
%%sql
WITH CTE AS 
(
	SELECT brand, sale_price AS sale_price, COUNT(*) AS count
	FROM transactions t
	JOIN brands b
	ON t.product_id = b.product_id
	WHERE brand IS NOT NULL
	GROUP BY brand, sale_price
	ORDER BY sale_price DESC
)
SELECT *
FROM CTE
WHERE count = (SELECT MAX(count) FROM CTE WHERE brand = 'Adidas') AND brand = 'Adidas'
GROUP BY brand, sale_price, count
UNION
SELECT *
FROM CTE
WHERE count = (SELECT MAX(count) FROM CTE WHERE brand = 'Nike') AND brand = 'Nike'
GROUP BY brand, sale_price, count

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
2 rows affected.

[('Adidas', Decimal('39.99'), 1081), ('Nike', Decimal('99.95'), 240)]

In [56]:
                                                # PROBLEM 11 #
# PART 1 
# Which months have a total revenue over 45,000$?

In [57]:
# The DATE_PART function is used in this query to get the month and the year from the date column in the transactions table.
# The function SUM was used to calculate the total revenue for every month.
# I added a HAVING clause since it's impossible to use aggregate functions in a WHERE CLAUSE. This clause will filter out all the months with less than 45,000$ in total revenue. 
# I used a GROUP BY statement for month and year columns. I also sorted the table by year and month respectively.

In [58]:
%%sql
SELECT CAST(DATE_PART('month', date) AS INT) AS month, 
       CAST(DATE_PART('year', date) AS INT) AS year, 
	   SUM(sale_price) AS total_revenue	
FROM transactions
GROUP BY month, year
HAVING SUM(sale_price) > 45000
ORDER BY 2, 3

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
13 rows affected.

[(1, 2018, Decimal('45161.71')),
 (6, 2018, Decimal('46193.66')),
 (7, 2018, Decimal('47111.89')),
 (10, 2019, Decimal('45403.93')),
 (7, 2019, Decimal('46012.82')),
 (12, 2019, Decimal('46716.27')),
 (8, 2019, Decimal('46840.04')),
 (11, 2019, Decimal('46859.83')),
 (3, 2019, Decimal('47287.03')),
 (5, 2019, Decimal('47538.22')),
 (1, 2019, Decimal('47585.67')),
 (1, 2020, Decimal('46985.65')),
 (2, 2020, Decimal('47526.71'))]

In [59]:
# PART 2 
# Find the month and year with the highest revenue.

In [60]:
# I used a CTE which is like the query in part 1, but without the HAVING clause. 
# I added a subquery in the WHERE clause to select the maximum total revenue.
# The month of January in 2019 was the month with the highest total revenue.

In [61]:
%%sql
WITH CTE AS 
(
	SELECT CAST(DATE_PART('month', date) AS INT) AS month, 
           CAST(DATE_PART('year', date) AS INT) AS year, 
           SUM(sale_price) AS total_revenue
	FROM transactions
    GROUP BY month, year
    ORDER BY 2, 1
)
SELECT *
FROM CTE
WHERE total_revenue = (SELECT MAX(total_revenue) FROM CTE)

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(1, 2019, Decimal('47585.67'))]

In [62]:
# PART 3
# Find the monthly average revenue for each year.

In [63]:
# The solve this problem, we can't simple use the AVG function. This will lead to an incorrect result.
# To find the average revenue per month for each year, we must divide the total yearly revenue by the number of months within that year.
# The get the number of months within each year, I used a COUNT function and added a DISTINCT statement. Without the DISTINCT statement, the result would be incorrect.

In [64]:
%%sql
SELECT CAST(DATE_PART('year', date) AS INT) AS year, 
       SUM(sale_price) AS total_revenue, 
	   ROUND(SUM(sale_price)/COUNT(DISTINCT DATE_PART('month', date)), 2) AS monthly_average
FROM transactions
GROUP BY year
ORDER BY year

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
3 rows affected.

[(2018, Decimal('524862.06'), Decimal('43738.51')),
 (2019, Decimal('542297.05'), Decimal('45191.42')),
 (2020, Decimal('154109.40'), Decimal('38527.35'))]

In [65]:
# The previous table showed that the average revenue for 2020 is low compared to 2018 and 2019. 
# This is because we divided the total revenue of 2020 by 4 (number of months), but the fourth month is not complete, therefore the query must be modified.
# In this query, I filtered out data from the month of April and only kept the data from January to March (3 months in total).
# We now see that the monthly average revenue for 2020 is higher than 2018 and 2019!

In [66]:
%%sql
SELECT CAST(DATE_PART('year', date) AS INT) AS year, SUM(sale_price) AS total_revenue, ROUND(SUM(sale_price)/COUNT(DISTINCT DATE_PART('month', date)), 2) AS monthly_average
FROM transactions
WHERE DATE_PART('year', date) = '2020' AND DATE_PART('month', date) <= 3
GROUP BY year
ORDER BY year

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(2020, Decimal('139288.98'), Decimal('46429.66'))]

In [67]:
# PART 4
# Find the total revenue and the average revenue by brand for each year.

In [68]:
# Very similar to part 3, but we must also join the brands table and GROUP BY brand. 
# Also, this time I used a UNION operator so that we can see all the data in one table.  
# We see that Nike's monthly average in 2020 is very high compared to other years (but 2020 is not yet over), whereas Adidas's monthly average is similar for every year.

In [69]:
%%sql
SELECT brand, 
       CAST(DATE_PART('year', date) AS INT) AS year, 
       SUM(sale_price) AS total_revenue, 
	   ROUND(SUM(sale_price)/COUNT(DISTINCT DATE_PART('month', date)), 2) AS monthly_average
FROM transactions t
JOIN brands b
ON t.product_id = b.product_id
WHERE DATE_PART('year', date) <> '2020'
GROUP BY brand, year

UNION 

SELECT brand, 
       CAST(DATE_PART('year', date) AS INT) AS year, 
       SUM(sale_price) AS total_revenue, 
	   ROUND(SUM(sale_price)/COUNT(DISTINCT DATE_PART('month', date)), 2) AS monthly_average
FROM transactions t
JOIN brands b
ON t.product_id = b.product_id
WHERE DATE_PART('year', date) = '2020' AND DATE_PART('month', date) <= 3
GROUP BY brand, year
ORDER BY brand, year

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
6 rows affected.

[('Adidas', 2018, Decimal('384846.67'), Decimal('32070.56')),
 ('Adidas', 2019, Decimal('399664.90'), Decimal('33305.41')),
 ('Adidas', 2020, Decimal('99937.35'), Decimal('33312.45')),
 ('Nike', 2018, Decimal('140015.39'), Decimal('11667.95')),
 ('Nike', 2019, Decimal('142632.15'), Decimal('11886.01')),
 ('Nike', 2020, Decimal('39351.63'), Decimal('13117.21'))]

In [70]:
                                                # PROBLEM 12 #
# PART 1
# List the total sales by month for all years combined.

In [71]:
# I used a case statement to replace the months from numbers to the actual name of the month. This makes it easier to read and see quickly which months have the highest sales. 
# I excluded sales from 2020, since the data stops during the month of April. If I had kept this data, it would have skewed the results for the months of Jan, Feb and March.
# The data is aggregated by month and the total revenue is sorted in descending order.
# We see that July has the highest total sales and that February has the lowest total sales.

In [72]:
%%sql
SELECT CASE 
       WHEN DATE_PART('month', date) = 1 THEN 'January' 
       WHEN DATE_PART('month', date) = 2 THEN 'February' 
	   WHEN DATE_PART('month', date) = 3 THEN 'March' 
	   WHEN DATE_PART('month', date) = 4 THEN 'April' 
	   WHEN DATE_PART('month', date) = 5 THEN 'May' 
	   WHEN DATE_PART('month', date) = 6 THEN 'June' 
	   WHEN DATE_PART('month', date) = 7 THEN 'July' 
       WHEN DATE_PART('month', date) = 8 THEN 'August' 
	   WHEN DATE_PART('month', date) = 9 THEN 'September' 
	   WHEN DATE_PART('month', date) = 10 THEN 'October' 
	   WHEN DATE_PART('month', date) = 11 THEN 'November' 
	   ELSE 'December' 
	   END AS month,
       
	   SUM(sale_price) AS total_revenue
	   
FROM transactions t
WHERE DATE_PART('year', date) <> '2020' 
GROUP BY month
ORDER BY 2 DESC

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
12 rows affected.

[('July', Decimal('93124.71')),
 ('January', Decimal('92747.38')),
 ('August', Decimal('91781.29')),
 ('May', Decimal('91086.75')),
 ('March', Decimal('90541.64')),
 ('October', Decimal('89950.95')),
 ('November', Decimal('89460.66')),
 ('June', Decimal('89435.83')),
 ('December', Decimal('89434.84')),
 ('April', Decimal('86580.85')),
 ('September', Decimal('84190.34')),
 ('February', Decimal('78823.87'))]

In [73]:
# PART 2
# List the total sales by season for each brand.

In [74]:
# I used a CASE statement to group the months in different categories (seasons).
# I joined the brands and transactions tables and excluded data from 2020 for the same reason as in part 1.
# Finally the data is aggregated by season and brand and I sorted total revenue in descending order.

In [75]:
%%sql
SELECT CASE 
       WHEN DATE_PART('month', date) IN (1,2,12)  THEN 'Winter'
	   WHEN DATE_PART('month', date) IN (3,4,5)  THEN 'Spring' 
	   WHEN DATE_PART('month', date) IN (6,7,8)  THEN 'Summer' 
	   WHEN DATE_PART('month', date) IN (9,10,11)  THEN 'Fall' 
       END AS season,
	   brand, SUM(sale_price) AS total_revenue
FROM brands b
JOIN transactions t
ON b.product_id = t.product_id
WHERE brand IS NOT NULL AND DATE_PART('year', date) <> '2020' 
GROUP BY season, brand
ORDER by total_revenue DESC

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
8 rows affected.

[('Summer', 'Adidas', Decimal('199313.53')),
 ('Spring', 'Adidas', Decimal('196516.91')),
 ('Winter', 'Adidas', Decimal('194508.93')),
 ('Fall', 'Adidas', Decimal('194172.20')),
 ('Summer', 'Nike', Decimal('75028.30')),
 ('Spring', 'Nike', Decimal('71692.33')),
 ('Fall', 'Nike', Decimal('69429.75')),
 ('Winter', 'Nike', Decimal('66497.16'))]

In [76]:
                                                # PROBLEM 13 #
# PART 1
# Create a table showing the difference in total revenue per month for the year 2019. Also include a column with the difference in a percentage format.

In [77]:
# I used the DATE_PART function to get the months and the years from the date column of the transactions table.
# We need the window function LAG() to solve this problem.
# We see that from January to February the company had the biggest decrease in total revenue and from February to March, the company saw the highest increase in total sales.
# The table also shows that the total revenue varies more within the first 5 months of the year.

In [78]:
%%sql
SELECT CAST(DATE_PART('year', date) AS INT) AS year, 
	   CAST(DATE_PART('month', date) AS INT) AS month, 
	   SUM(sale_price) AS total_monthly_revenue,
	   SUM(sale_price) - LAG(SUM(sale_price)) OVER() AS total_monthly_revenue_diff, 
	   CONCAT(ROUND((SUM(sale_price) - LAG(SUM(sale_price)) OVER()) / SUM(sale_price)*100, 2), '%') AS total_monthly_revenue_diff_percentage
FROM transactions 
WHERE DATE_PART('year', date) = 2019
GROUP BY month, year 
ORDER BY 1, 2

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
12 rows affected.

[(2019, 1, Decimal('47585.67'), None, '%'),
 (2019, 2, Decimal('39963.17'), Decimal('-7622.50'), '-19.07%'),
 (2019, 3, Decimal('47287.03'), Decimal('7323.86'), '15.49%'),
 (2019, 4, Decimal('42146.71'), Decimal('-5140.32'), '-12.20%'),
 (2019, 5, Decimal('47538.22'), Decimal('5391.51'), '11.34%'),
 (2019, 6, Decimal('43242.17'), Decimal('-4296.05'), '-9.93%'),
 (2019, 7, Decimal('46012.82'), Decimal('2770.65'), '6.02%'),
 (2019, 8, Decimal('46840.04'), Decimal('827.22'), '1.77%'),
 (2019, 9, Decimal('42701.19'), Decimal('-4138.85'), '-9.69%'),
 (2019, 10, Decimal('45403.93'), Decimal('2702.74'), '5.95%'),
 (2019, 11, Decimal('46859.83'), Decimal('1455.90'), '3.11%'),
 (2019, 12, Decimal('46716.27'), Decimal('-143.56'), '-0.31%')]

In [79]:
# PART 2
# Create a table showing the difference in average daily revenue per month for the year 2018 and Nike products only. Also include a column with the difference in a percentage format.

In [80]:
# The query is like part 1, but it's more complicated since we can't combine AVG and SUM functions together (Can't use AVG(SUM(sale_price))).
# I used a similar logic to problem 11 part 3, where I used a COUNT function with a distinct statement. So, I divide the monthly revenue by the number of days within that month.
# Finally, I filtered the data for the year 2018 and for Nike products.  
# The table shows a considerable decrease in daily average revenue in the month of March.

In [81]:
%%sql
SELECT CAST(DATE_PART('year', date) AS INT) AS year, 
       CAST(DATE_PART('month', date) AS INT) AS month, 
	   ROUND(SUM(sale_price)/COUNT(DISTINCT date), 2) AS avg_daily_revenue,
	   ROUND((SUM(sale_price)/COUNT(DISTINCT date)) - (LAG(SUM(sale_price)/COUNT(DISTINCT date)) OVER ()), 2) AS avg_daily_revenue_diff,
	   CONCAT(ROUND(((SUM(sale_price)/COUNT(DISTINCT date)) - (LAG(SUM(sale_price)/COUNT(DISTINCT date)) OVER ())) / (SUM(sale_price)/COUNT(DISTINCT date))*100, 2), '%') AS avg_daily_revenue_diff_percentage
FROM transactions t
JOIN brands b
ON t.product_id = b.product_id
WHERE brand = 'Nike' AND DATE_PART('year', date) = '2018'
GROUP BY month, year
ORDER BY month

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
12 rows affected.

[(2018, 1, Decimal('390.42'), None, '%'),
 (2018, 2, Decimal('359.15'), Decimal('-31.27'), '-8.71%'),
 (2018, 3, Decimal('423.76'), Decimal('64.61'), '15.25%'),
 (2018, 4, Decimal('460.39'), Decimal('36.63'), '7.96%'),
 (2018, 5, Decimal('336.48'), Decimal('-123.92'), '-36.83%'),
 (2018, 6, Decimal('452.26'), Decimal('115.79'), '25.60%'),
 (2018, 7, Decimal('423.72'), Decimal('-28.54'), '-6.74%'),
 (2018, 8, Decimal('367.49'), Decimal('-56.23'), '-15.30%'),
 (2018, 9, Decimal('334.98'), Decimal('-32.52'), '-9.71%'),
 (2018, 10, Decimal('361.97'), Decimal('27.00'), '7.46%'),
 (2018, 11, Decimal('397.76'), Decimal('35.79'), '9.00%'),
 (2018, 12, Decimal('377.61'), Decimal('-20.14'), '-5.33%')]

In [82]:
                                                # PROBLEM 14 #
# PART 1
# Create a table showing the monthly revenue and the running total for the year 2019 and for Addidas products only.

In [83]:
# I first wrote a query returning a table showing the monthly revenue for the year 2019.
# I used a window function that calculates the yearly revenue running total for 2019.

In [84]:
%%sql
WITH CTE AS 
(
    SELECT CAST(DATE_PART('year', date) AS INT) AS year, CAST(DATE_PART('month', date) AS INT) AS month, SUM(sale_price) as monthly_revenue
    FROM transactions t
    JOIN brands b
    ON t.product_id = b.product_id
    WHERE DATE_PART('year', date) = 2019 AND  brand = 'Adidas'
    GROUP BY month, year
)
SELECT year, month, monthly_revenue, SUM(monthly_revenue) OVER(ORDER BY month) total_revenue
FROM CTE
ORDER BY 1, 2

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
12 rows affected.

[(2019, 1, Decimal('36371.45'), Decimal('36371.45')),
 (2019, 2, Decimal('29732.50'), Decimal('66103.95')),
 (2019, 3, Decimal('34094.44'), Decimal('100198.39')),
 (2019, 4, Decimal('30344.23'), Decimal('130542.62')),
 (2019, 5, Decimal('36875.62'), Decimal('167418.24')),
 (2019, 6, Decimal('29961.01'), Decimal('197379.25')),
 (2019, 7, Decimal('34379.82'), Decimal('231759.07')),
 (2019, 8, Decimal('34397.77'), Decimal('266156.84')),
 (2019, 9, Decimal('30147.49'), Decimal('296304.33')),
 (2019, 10, Decimal('33544.93'), Decimal('329849.26')),
 (2019, 11, Decimal('34286.24'), Decimal('364135.50')),
 (2019, 12, Decimal('35529.40'), Decimal('399664.90'))]

In [85]:
# PART 2
# Create a query that will produce a table showing the daily moving average for the month of May in 2018.

In [86]:
# I first created a table showing the daily revenue for the month of May in 2018. 
# I used a window function that calculates the moving average for 31 days (whole month of May).

In [87]:
%%sql
WITH CTE AS 
(
   SELECT date, SUM(sale_price) as daily_revenue
   FROM transactions t
   JOIN brands b
   ON t.product_id = b.product_id
   WHERE DATE_PART('year', date) = 2018 AND DATE_PART('month', date) = 5
   GROUP BY date
)
SELECT date, daily_revenue, ROUND(AVG(daily_revenue) OVER W, 2) AS moving_daily_average
FROM CTE
WINDOW W AS (ORDER BY DATE_PART('month', date) ROWS BETWEEN 31 PRECEDING AND CURRENT ROW)
ORDER BY date

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
31 rows affected.

[(datetime.date(2018, 5, 1), Decimal('1624.97'), Decimal('1624.97')),
 (datetime.date(2018, 5, 2), Decimal('936.06'), Decimal('1280.52')),
 (datetime.date(2018, 5, 3), Decimal('2071.44'), Decimal('1544.16')),
 (datetime.date(2018, 5, 4), Decimal('1822.21'), Decimal('1613.67')),
 (datetime.date(2018, 5, 5), Decimal('1591.29'), Decimal('1609.19')),
 (datetime.date(2018, 5, 6), Decimal('1339.85'), Decimal('1564.30')),
 (datetime.date(2018, 5, 7), Decimal('1661.78'), Decimal('1578.23')),
 (datetime.date(2018, 5, 8), Decimal('1010.68'), Decimal('1507.29')),
 (datetime.date(2018, 5, 9), Decimal('1136.52'), Decimal('1466.09')),
 (datetime.date(2018, 5, 10), Decimal('1433.61'), Decimal('1462.84')),
 (datetime.date(2018, 5, 11), Decimal('1198.87'), Decimal('1438.84')),
 (datetime.date(2018, 5, 12), Decimal('1088.31'), Decimal('1409.63')),
 (datetime.date(2018, 5, 13), Decimal('1876.57'), Decimal('1445.55')),
 (datetime.date(2018, 5, 14), Decimal('1415.02'), Decimal('1443.37')),
 (datetime.date(2018, 5, 15), Decimal('1424.32'), Decimal('1442.10')),
 (datetime.date(2018, 5, 16), Decimal('1271.93'), Decimal('1431.46')),
 (datetime.date(2018, 5, 17), Decimal('1135.20'), Decimal('1414.04')),
 (datetime.date(2018, 5, 18), Decimal('1348.70'), Decimal('1410.41')),
 (datetime.date(2018, 5, 19), Decimal('1795.67'), Decimal('1430.68')),
 (datetime.date(2018, 5, 20), Decimal('1459.80'), Decimal('1432.14')),
 (datetime.date(2018, 5, 21), Decimal('1502.96'), Decimal('1435.51')),
 (datetime.date(2018, 5, 22), Decimal('1133.69'), Decimal('1421.79')),
 (datetime.date(2018, 5, 23), Decimal('1212.38'), Decimal('1412.69')),
 (datetime.date(2018, 5, 24), Decimal('1988.31'), Decimal('1436.67')),
 (datetime.date(2018, 5, 25), Decimal('1119.64'), Decimal('1423.99')),
 (datetime.date(2018, 5, 26), Decimal('1559.13'), Decimal('1429.19')),
 (datetime.date(2018, 5, 27), Decimal('1505.02'), Decimal('1432.00')),
 (datetime.date(2018, 5, 28), Decimal('1190.07'), Decimal('1423.36')),
 (datetime.date(2018, 5, 29), Decimal('1472.83'), Decimal('1425.06')),
 (datetime.date(2018, 5, 30), Decimal('952.21'), Decimal('1409.30')),
 (datetime.date(2018, 5, 31), Decimal('1269.49'), Decimal('1404.79'))]

In [88]:
                                                # PROBLEM 15 #
# PART 1
# Which day has the record for most products sold?

In [89]:
# We can solve this problem using the window function ROW_NUMBER(), thus we don't need a GROUP BY statement.
# This shows that the online retailer sold the most products on July 21, 2019.

In [90]:
%%sql
WITH CTE AS
(
	SELECT date, ROW_NUMBER() OVER(PARTITION BY date) AS number_of_products_sold
	FROM transactions
)
SELECT date, number_of_products_sold
FROM CTE
WHERE number_of_products_sold = (SELECT MAX(number_of_products_sold) FROM CTE)

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
1 rows affected.

[(datetime.date(2019, 7, 21), 40)]

In [91]:
# PART 2
# Rank the products having sold the most items.

In [92]:
# I used the DENSE_RANK() window function to solve this problem. 
# We also need a COUNT function, join transactions and info tables together and group by product_name.
# We see a total of 78 different ranks.

In [93]:
%%sql
SELECT product_name, COUNT(*) AS number_of_products, DENSE_RANK() OVER(ORDER BY COUNT(*) DESC)
FROM transactions t
JOIN info i
ON t.product_id = i.product_id
GROUP BY product_name
LIMIT 100

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
100 rows affected.

[("Men's adidas Originals Supercourt Shoes", 125, 1),
 ("Women's adidas Originals Sleek Shoes", 107, 2),
 ("Men's adidas Originals Continental 80 Shoes", 102, 3),
 ("Women's adidas Originals Sambarose Shoes", 101, 4),
 ('Unisex adidas Originals Marathon Tech Shoes', 96, 5),
 ("Men's adidas Originals Stan Smith Shoes", 83, 6),
 ("Women's adidas Originals NMD_R1 Shoes", 81, 7),
 ("Men's adidas Originals Rivalry Low Shoes", 80, 8),
 ('Nike Air Max 90', 79, 9),
 ("Men's adidas Originals Forest Grove Shoes", 76, 10),
 ("Women's adidas Originals Falcon Shoes", 75, 11),
 ("Men's adidas Sport Inspired VL Court 2.0 Shoes", 72, 12),
 ("Women's adidas Originals Continental 80 Shoes", 71, 13),
 ("Men's adidas Running Galaxy 4 Shoes", 71, 13),
 ('Unisex adidas Originals Skateboarding 3MC Shoes', 70, 14),
 ("Men's adidas Running Ultraboost 19 Shoes", 69, 15),
 ("Men's adidas Running Duramo 9 Shoes", 68, 16),
 ("Women's adidas Originals POD-S3.1 Shoes", 67, 17),
 ("Men's adidas Sport Inspired Grand Court Shoes", 67, 17),
 ("Women's adidas Originals Stan Smith Shoes", 61, 18),
 ("Women's adidas Originals Superstar Shoes", 61, 18),
 ("Men's adidas Running EnergyFalcon Shoes", 60, 19),
 ("Men's adidas Sport Inspired Drogo Shoes", 59, 20),
 ("Men's adidas Running Nepton 2.0 Shoes", 58, 21),
 ("Men's adidas Sport Inspired Archivo Shoes", 58, 21),
 ("Women's adidas Originals I-5923 Shoes", 58, 21),
 ("Men's adidas Running Asweerun Shoes", 57, 22),
 ("WOMEN'S ADIDAS ORIGINALS SAMBAROSE SHOES", 57, 22),
 ("Men's adidas Sport Inspired Blaze Runner Shoes", 57, 22),
 ("Men's adidas Originals Superstar Shoes", 56, 23),
 ("Men's adidas Outdoor Elevate 2018 Sandals", 56, 23),
 ("Women's adidas Originals Supercourt Shoes", 55, 24),
 ('Unisex adidas Originals Continental Vulc Shoes', 55, 24),
 ("Men's adidas Originals Skateboarding Seeley Shoes", 55, 24),
 ("Men's adidas Originals NMD_R1 Shoes", 54, 25),
 ("Men's adidas Originals Yung-1 Shoes", 54, 25),
 ("Men's adidas Outdoor Naha Shoes", 54, 25),
 ("Women's adidas Originals Rivalry Low Shoes", 54, 25),
 ("Men's adidas Sport Inspired Grand Court Base Shoes", 53, 26),
 ("Men's adidas Originals EQT Gazelle Shoes", 52, 27),
 ("Men's adidas Originals U_Path Run Shoes", 52, 27),
 ("Men's adidas Running SenseBoost GO Shoes", 52, 27),
 ('Nike Air Max 270 React', 51, 28),
 ("Women's adidas Running Ultraboost 19 Shoes", 51, 28),
 ("Men's adidas Running Kalus 1.0 Shoes", 50, 29),
 ("Women's adidas Running Sooraj Shoes", 49, 30),
 ("Men's adidas Sport Inspired Run 60s Shoes", 49, 30),
 ("Men's adidas Sport Inspired Arcadeis Shoes", 49, 30),
 ("Men's adidas Originals Yung-96 Shoes", 48, 31),
 ("Men's adidas Sport Inspired Questar Flow Shoes", 47, 32),
 ("Men's adidas Swim Coset II Slippers", 47, 32),
 ("Women's adidas Originals U_Path X Shoes", 46, 33),
 ("Men's adidas Sport Inspired Advantage Base Shoes", 45, 34),
 ('Nike Air Zoom Pegasus 36', 45, 34),
 ("Men's adidas Running Norad Shoes", 44, 35),
 ("Men's adidas Outdoor Echo Sandals", 44, 35),
 ("Women's adidas Sport Inspired VL Court 2.0 Shoes", 44, 35),
 ("Men's adidas Sport Inspired Court 80s Shoes", 44, 35),
 ("Men's Running Nova Flow Shoes", 44, 35),
 ("Men's adidas Running Stargon 1.0 Shoes", 44, 35),
 ("Men's adidas Originals Yung-96 Chasm Shoes", 43, 36),
 ("Men's adidas Running Asweego Shoes", 43, 36),
 ("Men's adidas Sport Inspired Nebular 2 Shoes", 43, 36),
 ("Men's adidas Running Raddis 1.0 shoes", 42, 37),
 ("Men's adidas Running Solar Blaze Shoes", 42, 37),
 ("Men's adidas Outdoor Argo Trek 19 Shoes", 42, 37),
 ("Men's adidas Sport Inspired Advantage Shoes", 42, 37),
 ("Women's adidas Originals Gazelle Shoes", 42, 37),
 ("MEN'S ADIDAS RUNNING LEGUS SHOES", 42, 37),
 ("Women's adidas Running PulseBoost HD Shoes", 41, 38),
 ("Men's adidas Sport Inspired Run 70s Shoes", 41, 38),
 ("Women's adidas Originals Marathon Tech Shoes", 41, 38),
 ("Men's adidas Outdoor Geocach 19 Shoes", 41, 38),
 ("Men's adidas Running Jerzo Shoes", 40, 39),
 ("Men's adidas Sport Inspired Quickspike Shoes", 40, 39),
 ("Women's adidas Sport Inspired Duramo Lite 2.0 Shoes", 40, 39),
 ("Women's adidas Originals Supercourt RX Shoes", 39, 40),
 ("MEN'S ADIDAS RUNNING ARIUS 1.0 SHOES", 39, 40),
 ("MEN'S ADIDAS RUNNING ERDIGA 4.0 SHOES", 39, 40),
 ("Men's adidas Sport Inspired Heawin Shoes", 39, 40),
 ("Men's adidas RunFalcon Shoes", 39, 40),
 ("Men's adidas Sport Inspired Binafo Shoes", 39, 40),
 ("Men's adidas Running Sedna Shoes", 39, 40),
 ('Nike Air Max 97', 39, 40),
 ("Women's adidas Originals Adilette Slides", 38, 41),
 ("Women's adidas Sport Inspired Archivo Shoes", 38, 41),
 ("Men's adidas Originals Swift Run Shoes", 38, 41),
 ("Men's adidas Sport Inspired Zeta 2.0 Shoes", 37, 42),
 ("MEN'S ADIDAS SPORT INSPIRED LITE RACER CLN SHOES", 37, 42),
 ("MEN'S ADIDAS ORIGINALS CAMPUS SHOES", 37, 42),
 ("Men's adidas Outdoor Hoist 2019 Sandals", 37, 42),
 ("Men's adidas Originals POD-S3.1 Shoes", 37, 42),
 ("Men's adidas Running Solar Drive 19 Shoes", 37, 42),
 ("Men's Sport Inspired Nebzed Shoes", 37, 42),
 ("Men's adidas Sport Inspired Cloudfoam Racer TR Shoes", 37, 42),
 ("Women's adidas Swim Jung Slippers", 36, 43),
 ("Women's adidas Originals Arkyn Shoes", 36, 43),
 ("Women's adidas Originals Deerupt Runner Shoes", 36, 43),
 ("Men's adidas Running Bound Shoes", 35, 44),
 ("Men's adidas Sport Inspired Fassar Shoes", 35, 44)]

In [94]:
# We can also use RANK function instead of DENSE_RANK. 
# I prefer DENSE_RANK, since RANK leaves gaps between the values. If we have two items with rank of 13, the next rank will be 15.

In [95]:
%%sql
SELECT product_name, COUNT(*) AS number_of_products, RANK() OVER(ORDER BY COUNT(*) DESC)
FROM transactions t
JOIN info i
ON t.product_id = i.product_id
GROUP BY product_name
LIMIT 100

 * postgresql://postgres:***@localhost:5432/Sports.Retailer.Project
100 rows affected.

[("Men's adidas Originals Supercourt Shoes", 125, 1),
 ("Women's adidas Originals Sleek Shoes", 107, 2),
 ("Men's adidas Originals Continental 80 Shoes", 102, 3),
 ("Women's adidas Originals Sambarose Shoes", 101, 4),
 ('Unisex adidas Originals Marathon Tech Shoes', 96, 5),
 ("Men's adidas Originals Stan Smith Shoes", 83, 6),
 ("Women's adidas Originals NMD_R1 Shoes", 81, 7),
 ("Men's adidas Originals Rivalry Low Shoes", 80, 8),
 ('Nike Air Max 90', 79, 9),
 ("Men's adidas Originals Forest Grove Shoes", 76, 10),
 ("Women's adidas Originals Falcon Shoes", 75, 11),
 ("Men's adidas Sport Inspired VL Court 2.0 Shoes", 72, 12),
 ("Women's adidas Originals Continental 80 Shoes", 71, 13),
 ("Men's adidas Running Galaxy 4 Shoes", 71, 13),
 ('Unisex adidas Originals Skateboarding 3MC Shoes', 70, 15),
 ("Men's adidas Running Ultraboost 19 Shoes", 69, 16),
 ("Men's adidas Running Duramo 9 Shoes", 68, 17),
 ("Women's adidas Originals POD-S3.1 Shoes", 67, 18),
 ("Men's adidas Sport Inspired Grand Court Shoes", 67, 18),
 ("Women's adidas Originals Stan Smith Shoes", 61, 20),
 ("Women's adidas Originals Superstar Shoes", 61, 20),
 ("Men's adidas Running EnergyFalcon Shoes", 60, 22),
 ("Men's adidas Sport Inspired Drogo Shoes", 59, 23),
 ("Men's adidas Running Nepton 2.0 Shoes", 58, 24),
 ("Men's adidas Sport Inspired Archivo Shoes", 58, 24),
 ("Women's adidas Originals I-5923 Shoes", 58, 24),
 ("Men's adidas Running Asweerun Shoes", 57, 27),
 ("WOMEN'S ADIDAS ORIGINALS SAMBAROSE SHOES", 57, 27),
 ("Men's adidas Sport Inspired Blaze Runner Shoes", 57, 27),
 ("Men's adidas Originals Superstar Shoes", 56, 30),
 ("Men's adidas Outdoor Elevate 2018 Sandals", 56, 30),
 ("Women's adidas Originals Supercourt Shoes", 55, 32),
 ('Unisex adidas Originals Continental Vulc Shoes', 55, 32),
 ("Men's adidas Originals Skateboarding Seeley Shoes", 55, 32),
 ("Men's adidas Originals NMD_R1 Shoes", 54, 35),
 ("Men's adidas Originals Yung-1 Shoes", 54, 35),
 ("Men's adidas Outdoor Naha Shoes", 54, 35),
 ("Women's adidas Originals Rivalry Low Shoes", 54, 35),
 ("Men's adidas Sport Inspired Grand Court Base Shoes", 53, 39),
 ("Men's adidas Originals EQT Gazelle Shoes", 52, 40),
 ("Men's adidas Originals U_Path Run Shoes", 52, 40),
 ("Men's adidas Running SenseBoost GO Shoes", 52, 40),
 ('Nike Air Max 270 React', 51, 43),
 ("Women's adidas Running Ultraboost 19 Shoes", 51, 43),
 ("Men's adidas Running Kalus 1.0 Shoes", 50, 45),
 ("Women's adidas Running Sooraj Shoes", 49, 46),
 ("Men's adidas Sport Inspired Run 60s Shoes", 49, 46),
 ("Men's adidas Sport Inspired Arcadeis Shoes", 49, 46),
 ("Men's adidas Originals Yung-96 Shoes", 48, 49),
 ("Men's adidas Sport Inspired Questar Flow Shoes", 47, 50),
 ("Men's adidas Swim Coset II Slippers", 47, 50),
 ("Women's adidas Originals U_Path X Shoes", 46, 52),
 ("Men's adidas Sport Inspired Advantage Base Shoes", 45, 53),
 ('Nike Air Zoom Pegasus 36', 45, 53),
 ("Men's adidas Running Norad Shoes", 44, 55),
 ("Men's adidas Outdoor Echo Sandals", 44, 55),
 ("Women's adidas Sport Inspired VL Court 2.0 Shoes", 44, 55),
 ("Men's adidas Sport Inspired Court 80s Shoes", 44, 55),
 ("Men's Running Nova Flow Shoes", 44, 55),
 ("Men's adidas Running Stargon 1.0 Shoes", 44, 55),
 ("Men's adidas Originals Yung-96 Chasm Shoes", 43, 61),
 ("Men's adidas Running Asweego Shoes", 43, 61),
 ("Men's adidas Sport Inspired Nebular 2 Shoes", 43, 61),
 ("Men's adidas Running Raddis 1.0 shoes", 42, 64),
 ("Men's adidas Running Solar Blaze Shoes", 42, 64),
 ("Men's adidas Outdoor Argo Trek 19 Shoes", 42, 64),
 ("Men's adidas Sport Inspired Advantage Shoes", 42, 64),
 ("Women's adidas Originals Gazelle Shoes", 42, 64),
 ("MEN'S ADIDAS RUNNING LEGUS SHOES", 42, 64),
 ("Women's adidas Running PulseBoost HD Shoes", 41, 70),
 ("Men's adidas Sport Inspired Run 70s Shoes", 41, 70),
 ("Women's adidas Originals Marathon Tech Shoes", 41, 70),
 ("Men's adidas Outdoor Geocach 19 Shoes", 41, 70),
 ("Men's adidas Running Jerzo Shoes", 40, 74),
 ("Men's adidas Sport Inspired Quickspike Shoes", 40, 74),
 ("Women's adidas Sport Inspired Duramo Lite 2.0 Shoes", 40, 74),
 ("Women's adidas Originals Supercourt RX Shoes", 39, 77),
 ("MEN'S ADIDAS RUNNING ARIUS 1.0 SHOES", 39, 77),
 ("MEN'S ADIDAS RUNNING ERDIGA 4.0 SHOES", 39, 77),
 ("Men's adidas Sport Inspired Heawin Shoes", 39, 77),
 ("Men's adidas RunFalcon Shoes", 39, 77),
 ("Men's adidas Sport Inspired Binafo Shoes", 39, 77),
 ("Men's adidas Running Sedna Shoes", 39, 77),
 ('Nike Air Max 97', 39, 77),
 ("Women's adidas Originals Adilette Slides", 38, 85),
 ("Women's adidas Sport Inspired Archivo Shoes", 38, 85),
 ("Men's adidas Originals Swift Run Shoes", 38, 85),
 ("Men's adidas Sport Inspired Zeta 2.0 Shoes", 37, 88),
 ("MEN'S ADIDAS SPORT INSPIRED LITE RACER CLN SHOES", 37, 88),
 ("MEN'S ADIDAS ORIGINALS CAMPUS SHOES", 37, 88),
 ("Men's adidas Outdoor Hoist 2019 Sandals", 37, 88),
 ("Men's adidas Originals POD-S3.1 Shoes", 37, 88),
 ("Men's adidas Running Solar Drive 19 Shoes", 37, 88),
 ("Men's Sport Inspired Nebzed Shoes", 37, 88),
 ("Men's adidas Sport Inspired Cloudfoam Racer TR Shoes", 37, 88),
 ("Women's adidas Swim Jung Slippers", 36, 96),
 ("Women's adidas Originals Arkyn Shoes", 36, 96),
 ("Women's adidas Originals Deerupt Runner Shoes", 36, 96),
 ("Men's adidas Running Bound Shoes", 35, 99),
 ("Men's adidas Sport Inspired Fassar Shoes", 35, 99)]